*** src/contracts/manager.rs:120:27: replace < with > in Manager::withdraw

*** mutation diff:
--- src/contracts/manager.rs
+++ replace < with > in Manager::withdraw
@@ -112,17 +112,17 @@
     }
 
     pub fn withdraw(&mut self, amount: U256) -> Result<(), Vec<u8>> {
         let sender = self.vm().msg_sender();
         let previous_balance = self.address_2deposit.get(sender);
         self.address_2minted.insert(sender, previous_balance - amount);
         match self.collat_ratio(sender) {
             Ok(result) => {
-                if result < U256::from(MIN_COLLAT_RATIO) {
+                if result > /* ~ changed by cargo-mutants ~ */ U256::from(MIN_COLLAT_RATIO) {
                     return Err(b"Undercollateralized".to_vec());
                 } else {
                     let weth_instance = IErc20::new(self.weth.get());
                     let _ = weth_instance.transfer(self, sender, amount);
                     Ok(())
                 }
             },
             Err(e) => return Err(e)

*** result: Success
