*** src/contracts/manager.rs:166:31: replace * with / in Manager::collat_ratio

*** mutation diff:
--- src/contracts/manager.rs
+++ replace * with / in Manager::collat_ratio
@@ -158,12 +158,12 @@
         let minted = self.address_2minted.get(user);
         if minted.is_zero() {
             return Ok(U256::MAX);
         }
         let deposited = self.address_2deposit.get(user);
         let price_raw = unsafe { &RawCall::new().call(self.oracle.get(), &latestAnswerCall {}.abi_encode()).unwrap() };
         let price = AggregatorV3Interface::latestAnswerCall::abi_decode_returns(&price_raw, true).unwrap()._0;
         let price_scaled = U256::from_str(&price.to_string()).unwrap() * U256::from(1e10 as u64);
-        let value = deposited * price_scaled / U256::from(1e18 as u64);
+        let value = deposited / /* ~ changed by cargo-mutants ~ */ price_scaled / U256::from(1e18 as u64);
         Ok(value / minted)
     }
 }

*** result: Success
