*** src/contracts/manager.rs:71:62: replace + with - in Manager::deposit

*** mutation diff:
--- src/contracts/manager.rs
+++ replace + with - in Manager::deposit
@@ -63,17 +63,17 @@
             let _ = &RawCall::new().call(self.weth.get(), &transferFromCall {
                 from: sender,
                 to: this,
                 value: amount,
             }.abi_encode());
         };
 
         let previus_balance = self.address_2deposit.get(sender);
-        self.address_2deposit.insert(sender, previus_balance + amount);
+        self.address_2deposit.insert(sender, previus_balance - /* ~ changed by cargo-mutants ~ */ amount);
     }
 
     pub fn burn(&mut self, amount: U256) -> Result<(), Vec<u8>> {
         let sender = self.vm().msg_sender();
         let previous_balance = self.address_2minted.get(sender);
         self.address_2minted.insert(sender, previous_balance - amount);
         let sh_usd_instance = IErc20::new(self.sh_usd.get());
         match sh_usd_instance.burn(self, sender, amount) {

*** result: Success
