*** src/contracts/manager.rs:77:62: replace - with + in Manager::burn

*** mutation diff:
--- src/contracts/manager.rs
+++ replace - with + in Manager::burn
@@ -69,17 +69,17 @@
 
         let previus_balance = self.address_2deposit.get(sender);
         self.address_2deposit.insert(sender, previus_balance + amount);
     }
 
     pub fn burn(&mut self, amount: U256) -> Result<(), Vec<u8>> {
         let sender = self.vm().msg_sender();
         let previous_balance = self.address_2minted.get(sender);
-        self.address_2minted.insert(sender, previous_balance - amount);
+        self.address_2minted.insert(sender, previous_balance + /* ~ changed by cargo-mutants ~ */ amount);
         let sh_usd_instance = IErc20::new(self.sh_usd.get());
         match sh_usd_instance.burn(self, sender, amount) {
             Ok(_) => Ok(()),
             Err(e) => Err(e.into()),
         }
 
     }

*** result: Success
