*** src/contracts/sh_usd.rs:44:35: replace == with != in ShUSD::mint

*** mutation diff:
--- src/contracts/sh_usd.rs
+++ replace == with != in ShUSD::mint
@@ -36,17 +36,17 @@
 
 #[cfg_attr(feature = "sh-usd", stylus_sdk::prelude::public, inherit(erc20::Erc20::<MicroParams>))]
 impl ShUSD {
     pub fn init(&mut self, manager_address: Address) {
         self.manager.set(manager_address);
     }
 
     pub fn mint(&mut self, to: Address, amount: U256) -> Result<(), ShUSDErrors> {
-        if self.vm().msg_sender() == self.manager.get() {
+        if self.vm().msg_sender() != /* ~ changed by cargo-mutants ~ */ self.manager.get() {
             let _ = self.erc20.mint(to, amount);
             Ok(())
         } else {
             Err(ShUSDErrors::OnlyManagerCanCall(OnlyManagerCanCall {}))
         }
     }
 
     pub fn burn(&mut self, from: Address, amount: U256) -> Result<(), ShUSDErrors> {

*** result: Success
