*** src/contracts/sh_usd.rs:53:35: replace == with != in ShUSD::burn

*** mutation diff:
--- src/contracts/sh_usd.rs
+++ replace == with != in ShUSD::burn
@@ -45,17 +45,17 @@
             let _ = self.erc20.mint(to, amount);
             Ok(())
         } else {
             Err(ShUSDErrors::OnlyManagerCanCall(OnlyManagerCanCall {}))
         }
     }
 
     pub fn burn(&mut self, from: Address, amount: U256) -> Result<(), ShUSDErrors> {
-        if self.vm().msg_sender() == self.manager.get() {
+        if self.vm().msg_sender() != /* ~ changed by cargo-mutants ~ */ self.manager.get() {
             let _ = self.erc20.burn(from, amount);
             Ok(())
         } else {
             Err(ShUSDErrors::OnlyManagerCanCall(OnlyManagerCanCall {}))
         }
     }
 }

*** result: Success
