*** src/contracts/sh_usd.rs:53:9: replace ShUSD::burn -> Result<(), ShUSDErrors> with Ok(())

*** mutation diff:
--- src/contracts/sh_usd.rs
+++ replace ShUSD::burn -> Result<(), ShUSDErrors> with Ok(())
@@ -45,17 +45,12 @@
             let _ = self.erc20.mint(to, amount);
             Ok(())
         } else {
             Err(ShUSDErrors::OnlyManagerCanCall(OnlyManagerCanCall {}))
         }
     }
 
     pub fn burn(&mut self, from: Address, amount: U256) -> Result<(), ShUSDErrors> {
-        if self.vm().msg_sender() == self.manager.get() {
-            let _ = self.erc20.burn(from, amount);
-            Ok(())
-        } else {
-            Err(ShUSDErrors::OnlyManagerCanCall(OnlyManagerCanCall {}))
-        }
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }

*** result: Success
