*** src/test/test_oracle.rs:14:64: replace TestOracle::latest_answer -> Result<I256, Vec<u8>> with Ok(Default::default())

*** mutation diff:
--- src/test/test_oracle.rs
+++ replace TestOracle::latest_answer -> Result<I256, Vec<u8>> with Ok(Default::default())
@@ -6,10 +6,10 @@
 
 #[cfg_attr(feature = "test-oracle", stylus_sdk::prelude::entrypoint)]
 #[storage]
 pub struct TestOracle;
 
 #[cfg_attr(feature = "test-oracle", stylus_sdk::prelude::public)]
 #[cfg(feature = "test-oracle")]
 impl TestOracle {
-    pub fn latest_answer(&mut self) -> Result<I256, Vec<u8>> { Ok(PRICE) }
+    pub fn latest_answer(&mut self) -> Result<I256, Vec<u8>> { Ok(Default::default()) /* ~ changed by cargo-mutants ~ */ }
 }

*** result: Success
