*** src/test/test_weth.rs:40:9: replace ShUSD::init with ()

*** mutation diff:
--- src/test/test_weth.rs
+++ replace ShUSD::init with ()
@@ -32,17 +32,17 @@
 #[derive(SolidityError)]
 pub enum ShUSDErrors {
     OnlyManagerCanCall(OnlyManagerCanCall),
 }
 
 #[cfg_attr(feature = "test-weth", stylus_sdk::prelude::public, inherit(erc20::Erc20::<MicroParams>))]
 impl ShUSD {
     pub fn init(&mut self, manager_address: Address) {
-        self.manager.set(manager_address);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn mint(&mut self, to: Address, amount: U256) -> Result<(), ShUSDErrors> {
         if self.vm().msg_sender() == self.manager.get() {
             let _ = self.erc20.mint(to, amount);
             Ok(())
         } else {
             Err(ShUSDErrors::OnlyManagerCanCall(OnlyManagerCanCall {}))

*** result: Success
