*** src/token/erc20.rs:124:55: replace - with / in Erc20<T>::burn

*** mutation diff:
--- src/token/erc20.rs
+++ replace - with / in Erc20<T>::burn
@@ -116,17 +116,17 @@
                 from: address,
                 have: old_balance,
                 want: value,
             }));
         }
         balance.set(old_balance - value);
 
         // Decreasing the total supply
-        self.total_supply.set(self.total_supply.get() - value);
+        self.total_supply.set(self.total_supply.get() / /* ~ changed by cargo-mutants ~ */ value);
 
         // Emitting the transfer event
         log(self.vm(),Transfer {
             from: address,
             to: Address::ZERO,
             value,
         });

*** result: Success
