*** src/token/erc20.rs:148:9: replace Erc20<T>::symbol -> String with "xyzzy".into()

*** mutation diff:
--- src/token/erc20.rs
+++ replace Erc20<T>::symbol -> String with "xyzzy".into()
@@ -140,17 +140,17 @@
 impl<T: Erc20Params> Erc20<T> {
     /// Immutable token name
     pub fn name() -> String {
         T::NAME.into()
     }
 
     /// Immutable token symbol
     pub fn symbol() -> String {
-        T::SYMBOL.into()
+        "xyzzy".into() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Immutable token decimals
     pub fn decimals() -> u8 {
         T::DECIMALS
     }
 
     /// Total supply of tokens

*** result: Success
