*** src/token/erc20.rs:153:9: replace Erc20<T>::decimals -> u8 with 0

*** mutation diff:
--- src/token/erc20.rs
+++ replace Erc20<T>::decimals -> u8 with 0
@@ -145,17 +145,17 @@
 
     /// Immutable token symbol
     pub fn symbol() -> String {
         T::SYMBOL.into()
     }
 
     /// Immutable token decimals
     pub fn decimals() -> u8 {
-        T::DECIMALS
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Total supply of tokens
     pub fn total_supply(&self) -> U256 {
         self.total_supply.get()
     }
 
     /// Balance of `address`

*** result: Success
