*** src/token/erc20.rs:163:9: replace Erc20<T>::balance_of -> U256 with Default::default()

*** mutation diff:
--- src/token/erc20.rs
+++ replace Erc20<T>::balance_of -> U256 with Default::default()
@@ -155,17 +155,17 @@
 
     /// Total supply of tokens
     pub fn total_supply(&self) -> U256 {
         self.total_supply.get()
     }
 
     /// Balance of `address`
     pub fn balance_of(&self, owner: Address) -> U256 {
-        self.balances.get(owner)
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Transfers `value` tokens from msg::sender() to `to`
     pub fn transfer(&mut self, to: Address, value: U256) -> Result<bool, Erc20Error> {
         self._transfer(self.vm().msg_sender(), to, value)?;
         Ok(true)
     }

*** result: Success
