*** src/token/erc20.rs:168:9: replace Erc20<T>::transfer -> Result<bool, Erc20Error> with Ok(true)

*** mutation diff:
--- src/token/erc20.rs
+++ replace Erc20<T>::transfer -> Result<bool, Erc20Error> with Ok(true)
@@ -160,18 +160,17 @@
 
     /// Balance of `address`
     pub fn balance_of(&self, owner: Address) -> U256 {
         self.balances.get(owner)
     }
 
     /// Transfers `value` tokens from msg::sender() to `to`
     pub fn transfer(&mut self, to: Address, value: U256) -> Result<bool, Erc20Error> {
-        self._transfer(self.vm().msg_sender(), to, value)?;
-        Ok(true)
+        Ok(true) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Transfers `value` tokens from `from` to `to`
     /// (msg::sender() must be able to spend at least `value` tokens from `from`)
     pub fn transfer_from(
         &mut self,
         from: Address,
         to: Address,

*** result: Success
