*** src/token/erc20.rs:205:9: replace Erc20<T>::approve -> bool with false

*** mutation diff:
--- src/token/erc20.rs
+++ replace Erc20<T>::approve -> bool with false
@@ -197,22 +197,16 @@
         // Calls the internal transfer function
         self._transfer(from, to, value)?;
 
         Ok(true)
     }
 
     /// Approves the spenditure of `value` tokens of msg::sender() to `spender`
     pub fn approve(&mut self, spender: Address, value: U256) -> bool {
-        self.allowances.setter(self.vm().msg_sender()).insert(spender, value);
-        log(self.vm(), Approval {
-            owner: self.vm().msg_sender(),
-            spender,
-            value,
-        });
-        true
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns the allowance of `spender` on `owner`'s tokens
     pub fn allowance(&self, owner: Address, spender: Address) -> U256 {
         self.allowances.getter(owner).get(spender)
     }
 }
\ No newline at end of file

*** result: Success
