*** src/token/erc20.rs:216:9: replace Erc20<T>::allowance -> U256 with Default::default()

*** mutation diff:
--- src/token/erc20.rs
+++ replace Erc20<T>::allowance -> U256 with Default::default()
@@ -208,11 +208,11 @@
             spender,
             value,
         });
         true
     }
 
     /// Returns the allowance of `spender` on `owner`'s tokens
     pub fn allowance(&self, owner: Address, spender: Address) -> U256 {
-        self.allowances.getter(owner).get(spender)
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
\ No newline at end of file

*** result: Success
