*** src/token/erc20.rs:70:31: replace < with == in Erc20<T>::_transfer

*** mutation diff:
--- src/token/erc20.rs
+++ replace < with == in Erc20<T>::_transfer
@@ -62,17 +62,17 @@
 // Note: modifying storage will become much prettier soon
 impl<T: Erc20Params> Erc20<T> {
     /// Movement of funds between 2 accounts
     /// (invoked by the public transfer() and transfer_from() functions )
     pub fn _transfer(&mut self, from: Address, to: Address, value: U256) -> Result<(), Erc20Error> {
         // Decreasing sender balance
         let mut sender_balance = self.balances.setter(from);
         let old_sender_balance = sender_balance.get();
-        if old_sender_balance < value {
+        if old_sender_balance == /* ~ changed by cargo-mutants ~ */ value {
             return Err(Erc20Error::InsufficientBalance(InsufficientBalance {
                 from,
                 have: old_sender_balance,
                 want: value,
             }));
         }
         sender_balance.set(old_sender_balance - value);

*** result: Success
