*** src/token/erc20.rs:92:9: replace Erc20<T>::mint -> Result<(), Erc20Error> with Ok(())

*** mutation diff:
--- src/token/erc20.rs
+++ replace Erc20<T>::mint -> Result<(), Erc20Error> with Ok(())
@@ -84,31 +84,17 @@
         // Emitting the transfer event
         log(self.vm(), Transfer { from, to, value });
         Ok(())
     }
 
     /// Mints `value` tokens to `address`
     pub fn mint(&mut self, address: Address, value: U256) -> Result<(), Erc20Error> {
         // Increasing balance
-        let mut balance = self.balances.setter(address);
-        let new_balance = balance.get() + value;
-        balance.set(new_balance);
-
-        // Increasing total supply
-        self.total_supply.set(self.total_supply.get() + value);
-
-        // Emitting the transfer event
-        log(self.vm(), Transfer {
-            from: Address::ZERO,
-            to: address,
-            value,
-        });
-
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Burns `value` tokens from `address`
     pub fn burn(&mut self, address: Address, value: U256) -> Result<(), Erc20Error> {
         // Decreasing balance
         let mut balance = self.balances.setter(address);
         let old_balance = balance.get();
         if old_balance < value {

*** result: Success
