*** src/token/erc20.rs:97:55: replace + with - in Erc20<T>::mint

*** mutation diff:
--- src/token/erc20.rs
+++ replace + with - in Erc20<T>::mint
@@ -89,17 +89,17 @@
     /// Mints `value` tokens to `address`
     pub fn mint(&mut self, address: Address, value: U256) -> Result<(), Erc20Error> {
         // Increasing balance
         let mut balance = self.balances.setter(address);
         let new_balance = balance.get() + value;
         balance.set(new_balance);
 
         // Increasing total supply
-        self.total_supply.set(self.total_supply.get() + value);
+        self.total_supply.set(self.total_supply.get() - /* ~ changed by cargo-mutants ~ */ value);
 
         // Emitting the transfer event
         log(self.vm(), Transfer {
             from: Address::ZERO,
             to: address,
             value,
         });

*** result: Success
